Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/Microchip.PIC32MZ-DA_DFP.pdsc
<?xml version='1.0' encoding='ASCII'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.3" xs:schemaLocation="http://www.atmel.com/schemas/pack-device-atmel-extension PACK.DEVICE.ATMEL.EXTENSION.xsd" xs:noNamespaceSchemaLocation="PACK.ATMEL.xsd">
   <vendor>Microchip</vendor>
   <url>https://packs.download.microchip.com/</url>
   <name>PIC32MZ-DA_DFP</name>
   <description>Microchip PIC32MZ-DA Series Device Support</description>
   <releases>
      <release version="1.4.118" date="2021-01-26">Updated deep sleep module.</release>
      <release version="1.3.112" date="2020-08-03">Updated clause 2 of the license text in headers, linker scripts and .S files to no require publication of copyright notice in embedded applications. Split RCON module. Updated Revision ID.</release>
      <release version="1.2.102" date="2020-02-12">Updated XC32 linker script to only link processor.o for version less than 2.10, newer versions will use a device specific .S file instead.</release>
      <release version="1.1.98" date="2019-10-15">Added IPC33.DMA1IS and IPC33.DMA1IP.</release>
      <release version="1.0.69" date="2019-07-11">Added XC32 support files. Removed xDEVCFG3.EXTDDRSIZE.</release>
      <release version="1.0.42" date="2019-01-24">Initial release.</release>
   </releases>
   <keywords>
      <keyword>Microchip</keyword>
      <keyword>Device Family Package Microchip</keyword>
      <keyword>Device Support</keyword>
      <keyword>PIC32MZ-DA</keyword>
   </keywords>
   <devices>
      <family Dfamily="PIC32MZ-DA" Dvendor="Microchip:3">
         <environment name="microchip">
            <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
               <mchp:prerequisite component="MPLAB X IDE" version="[5.10-"/>
               <mchp:prerequisite component="MPLAB X IPE" version="[5.10-"/>
            </mchp:extension>
         </environment>
         <device Dname="PIC32MZ1064DAK169">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ1064DAK169.atdf"/>
                  <at:variant ordercode="" vccmin="2.2" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="true" name="code" rw="RW" size="0x100000" start="0x1d000000" type="flash" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="true" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="flash" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x50" start="0x1fc0ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x50" start="0x1fc2ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x50" start="0x1fc2ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x50" start="0x1fc4ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x50" start="0x1fc4ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x50" start="0x1fc6ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x50" start="0x1fc6ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0xa0000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1a00" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0x10000" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc400" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb6_std" rw="" size="0x400" start="0x1f8c0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0xd000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx0" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx1" rw="" size="0x10000" start="0x1f900000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx2" rw="" size="0x10000" start="0x1f910000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx3" rw="" size="0x10000" start="0x1f920000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ1064DAK169.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.pic32">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ1064DAK169" title="Device page for PIC32MZ1064DAK169"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ1064DAK169" title="Datasheet"/>
         </device>
