Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/Microchip.PIC32MZ-DA_DFP.pdsc
         <device Dname="PIC32MZ1025DAR169">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ1025DAR169.atdf"/>
                  <at:variant ordercode="" vccmin="2.2" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="true" name="code" rw="RW" size="0x100000" start="0x1d000000" type="flash" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="true" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="flash" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x50" start="0x1fc0ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x50" start="0x1fc2ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x50" start="0x1fc2ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x50" start="0x1fc4ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x50" start="0x1fc4ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x50" start="0x1fc6ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x50" start="0x1fc6ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0x40000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1a00" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0x10000" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc400" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb6_std" rw="" size="0x400" start="0x1f8c0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0xd000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx0" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx1" rw="" size="0x10000" start="0x1f900000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx2" rw="" size="0x10000" start="0x1f910000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx3" rw="" size="0x10000" start="0x1f920000" type="" address-space="base"/>
                  <at:memory exec="" name="ddr_data_mem" rw="" size="0x2000000" start="0x08000000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ1025DAR169.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.pic32">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ1025DAR169" title="Device page for PIC32MZ1025DAR169"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ1025DAR169" title="Datasheet"/>
         </device>
         <device Dname="PIC32MZ2064DAR169">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ2064DAR169.atdf"/>
                  <at:variant ordercode="" vccmin="2.2" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x200000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="true" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="flash" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x50" start="0x1fc0ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x50" start="0x1fc2ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x50" start="0x1fc2ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x50" start="0x1fc4ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x50" start="0x1fc4ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x50" start="0x1fc6ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x50" start="0x1fc6ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0xa0000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1a00" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0x10000" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc400" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb6_std" rw="" size="0x400" start="0x1f8c0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0xd000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx0" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx1" rw="" size="0x10000" start="0x1f900000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx2" rw="" size="0x10000" start="0x1f910000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx3" rw="" size="0x10000" start="0x1f920000" type="" address-space="base"/>
                  <at:memory exec="" name="ddr_data_mem" rw="" size="0x2000000" start="0x08000000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ2064DAR169.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.pic32">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ2064DAR169" title="Device page for PIC32MZ2064DAR169"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ2064DAR169" title="Datasheet"/>
         </device>
         <device Dname="PIC32MZ2025DAS176">
            <processor Dcore="32xxxx" Dendian="Little-endian" Dmpu="MPU" Dfpu="DP_FPU"/>
            <environment name="atmel">
               <at:extension xmlns:at="http://www.atmel.com/schemas/pack-device-atmel-extension" schemaVersion="1.0">
                  <at:atdf name="atdf/PIC32MZ2025DAS176.atdf"/>
                  <at:variant ordercode="" vccmin="2.2" vccmax="3.6" tempmin="-40" tempmax="+85"/>
                  <at:memory exec="" name="emulation" rw="" size="0x100000" start="0xff300000" type="" address-space="base"/>
                  <at:memory exec="" name="devid" rw="" size="0x0" start="0xffffffff" type="" address-space="base"/>
                  <at:memory exec="" name="code" rw="" size="0x200000" start="0x1d000000" type="" address-space="base"/>
                  <at:memory exec="" name="testmem" rw="" size="0x4000" start="0x1fc74000" type="" address-space="base"/>
                  <at:memory exec="true" name="boot1" rw="" size="0xff00" start="0x1fc40000" type="flash" address-space="base"/>
                  <at:memory exec="" name="boot1lastpage" rw="" size="0x4000" start="0x1fc50000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2" rw="" size="0xff00" start="0x1fc60000" type="" address-space="base"/>
                  <at:memory exec="" name="boot2lastpage" rw="" size="0x4000" start="0x1fc70000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootalias" rw="" size="0xff00" start="0x1fc20000" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliaslastpage" rw="" size="0x4000" start="0x1fc30000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootalias" rw="" size="0xff00" start="0x1fc00000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliaslastpage" rw="" size="0x4000" start="0x1fc10000" type="" address-space="base"/>
                  <at:memory exec="" name="lowerbootaliasaltconfig" rw="" size="0x50" start="0x1fc0ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasaltconfig" rw="" size="0x50" start="0x1fc2ff30" type="" address-space="base"/>
                  <at:memory exec="" name="upperbootaliasconfig" rw="" size="0x50" start="0x1fc2ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot1config" rw="" size="0x50" start="0x1fc4ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot1config" rw="" size="0x50" start="0x1fc4ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="altboot2config" rw="" size="0x50" start="0x1fc6ff30" type="" address-space="base"/>
                  <at:memory exec="" name="boot2config" rw="" size="0x50" start="0x1fc6ffb0" type="" address-space="base"/>
                  <at:memory exec="" name="kseg0_data_mem" rw="" size="0x40000" start="0x0" type="" address-space="base"/>
                  <at:memory exec="" name="ebi_data_mem" rw="" size="0x4000000" start="0x20000000" type="" address-space="base"/>
                  <at:memory exec="" name="sqi_data_mem" rw="" size="0x4000000" start="0x30000000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_std" rw="" size="0x1a00" start="0x1f800000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb1_fast" rw="" size="0x2000" start="0x1f810000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb2_std" rw="" size="0x10000" start="0x1f820000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb3_std" rw="" size="0xc400" start="0x1f840000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb4_std" rw="" size="0xa00" start="0x1f860000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb5_std" rw="" size="0x5000" start="0x1f880000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_pb6_std" rw="" size="0x400" start="0x1f8c0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_indep" rw="" size="0xd000" start="0x1f8e0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx0" rw="" size="0x10000" start="0x1f8f0000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx1" rw="" size="0x10000" start="0x1f900000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx2" rw="" size="0x10000" start="0x1f910000" type="" address-space="base"/>
                  <at:memory exec="" name="periph_ssx3" rw="" size="0x10000" start="0x1f920000" type="" address-space="base"/>
                  <at:memory exec="" name="ddr_data_mem" rw="" size="0x2000000" start="0x08000000" type="" address-space="base"/>
                  <at:interface type="samjtag" name="JTAG"/>
                  <at:interface type="swd" name="SWD"/>
                  <at:tool id="com.atmel.avrdbg.tool.atmelice"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.edbgc"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagice3plus"/>
                  <at:tool id="com.atmel.avrdbg.tool.jtagicemk3"/>
                  <at:tool id="com.atmel.avrdbg.tool.medbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.nedbg"/>
                  <at:tool id="com.atmel.avrdbg.tool.pickit4"/>
                  <at:tool id="com.atmel.avrdbg.tool.powerdebugger"/>
                  <at:tool id="com.atmel.avrdbg.tool.samice"/>
                  <at:tool id="com.atmel.avrdbg.tool.snap"/>
               </at:extension>
            </environment>
            <environment name="microchip">
               <mchp:extension xmlns:mchp="http://crownking/pack-device-microchip-extension" schemaVersion="1.0">
                  <mchp:pic name="edc/PIC32MZ2025DAS176.PIC"/>
                  <mchp:xc32 name="xc32"/>
                  <mchp:hwtool type="mplab.mpheader">
                     <mchp:file name="hwtools/mplab/MPHeader.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="mplab.pluginboardsupport">
                     <mchp:file name="hwtools/mplab/PluginBoardSupport.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="sdm">
                     <mchp:file name="hwtools/sdm/sdmCompilers.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE.xml"/>
                     <mchp:file name="hwtools/sdm/sdmDebuggerMap.xml"/>
                     <mchp:file name="hwtools/sdm/sdmRealICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICE4.xml"/>
                     <mchp:file name="hwtools/sdm/sdmICD3.xml"/>
                     <mchp:file name="hwtools/sdm/sdmSimulator.xml"/>
                  </mchp:hwtool>
                  <mchp:hwtool type="persfr.pic32">
                     <mchp:file name="hwtools/persfr/pic32.persfr"/>
                  </mchp:hwtool>
               </mchp:extension>
            </environment>
            <book name="https://www.microchip.com/wwwproducts/Devices.aspx?product=PIC32MZ2025DAS176" title="Device page for PIC32MZ2025DAS176"/>
            <book name="https://www.microchip.com/wwwproducts/productds/PIC32MZ2025DAS176" title="Datasheet"/>
         </device>
